In [2]:
import pandas as pd
import numpy as np

## Grouping
* groupby()
* out = df.groupby('')
* out.groups
* out.size
use these func to access output

In [3]:
data = pd.read_csv(r'C:\Users\omc\Desktop\Data Science\Populationoutput.csv')

In [4]:
data

,Unnamed: 0,State,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
0,0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
1,1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
2,2,Arunachal Pradesh,88695,85828,174523,39439,38352,77791,174523
3,3,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540
4,0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
5,1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
6,3,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540

In [5]:
del data['Unnamed: 0']

In [6]:
datagb = data.groupby('State')
#returns grouby object

In [7]:
datagb.size()

State
Andaman & Nicobar Islands    2
Andhra Pradesh               2
Arunachal Pradesh            1
Assam                        2
dtype: int64

In [8]:
datagb.groups

{'Andaman & Nicobar Islands': Int64Index([0, 4], dtype='int64'),
 'Andhra Pradesh': Int64Index([1, 5], dtype='int64'),
 'Arunachal Pradesh': Int64Index([2], dtype='int64'),
 'Assam': Int64Index([3, 6], dtype='int64')}

In [9]:
l = ['01/01/2017','02/01/2017','23/04/']

In [10]:
out = lambda l: l.split('/')[1]

In [11]:
print(out)

<function <lambda> at 0x0000000009058488>

In [12]:
datagb.size()

State
Andaman & Nicobar Islands    2
Andhra Pradesh               2
Arunachal Pradesh            1
Assam                        2
dtype: int64

In [13]:
#groupby ->date

In [14]:
#to fetch months from all years
l = ['01/01/2017','02/01/2017','23/04/2017']
s=[]
for i in l:
    out = lambda i :i.split('/')[1]
    s.append(out)

In [15]:
data

,State,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
2,Arunachal Pradesh,88695,85828,174523,39439,38352,77791,174523
3,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540
4,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
5,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
6,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540

In [16]:
#football example -> pls refer to www.github.com/zekelabs/data-science-ml-foundation-10 
#file name -> New-7

In [17]:
data.head(3)

,State,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
2,Arunachal Pradesh,88695,85828,174523,39439,38352,77791,174523

In [18]:
data.tail(3)

,State,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
4,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
5,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
6,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540


## Filter function

In [19]:
type(data)

pandas.core.frame.DataFrame

In [20]:
data.filter(items=['State'])

                       State
0  Andaman & Nicobar Islands
1             Andhra Pradesh
2          Arunachal Pradesh
3                      Assam
4  Andaman & Nicobar Islands
5             Andhra Pradesh
6                      Assam

In [21]:
help(data.filter)

Help on method filter in module pandas.core.generic:

filter(items=None, like=None, regex=None, axis=None) method of pandas.core.frame.DataFrame instance
    Subset rows or columns of dataframe according to labels in
    the specified index.

    Note that this routine does not filter a dataframe on its
    contents. The filter is applied to the labels of the index.

    Parameters
    ----------
    items : list-like
        List of info axis to restrict to (must not all be present)
    like : string
        Keep info axis where "arg in col == True"
    regex : string (regular expression)
        Keep info axis with re.search(regex, col) == True
    axis : int or string axis name
        The axis to filter on.  By default this is the info axis,
        'index' for Series, 'columns' for DataFrame

    Returns
    -------
    same type as input object

    Examples
    --------
    >>> df
    one  two  three
    mouse     1    2      3
    rabbit    4    5      6

    >>> # select columns by name
    >>> df.filter(items=['one', 'three'])
    one  three
    mouse     1      3
    rabbit    4      6

    >>> # select columns by regular expression
    >>> df.filter(regex='e$', axis=1)
    one  three
    mouse     1      3
    rabbit    4      6

    >>> # select rows containing 'bbi'
    >>> df.filter(like='bbi', axis=0)
    one  two  three
    rabbit    4    5      6

    See Also
    --------
    pandas.DataFrame.select

    Notes
    -----
    The ``items``, ``like``, and ``regex`` parameters are
    enforced to be mutually exclusive.

    ``axis`` defaults to the info axis that is used when indexing
    with ``[]``.

In [22]:
data.head()

,State,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
0,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
1,Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
2,Arunachal Pradesh,88695,85828,174523,39439,38352,77791,174523
3,Assam,1792270,1714270,3506540,944482,894428,1838910,3506540
4,Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315

In [23]:
data.filter(items=['State','Male ','Female '])

                       State    Male   Female
0  Andaman & Nicobar Islands    17547    17768
1             Andhra Pradesh  2165879  2032435
2          Arunachal Pradesh    88695    85828
3                      Assam  1792270  1714270
4  Andaman & Nicobar Islands    17547    17768
5             Andhra Pradesh  2165879  2032435
6                      Assam  1792270  1714270

In [24]:
data.set_index('State')

,Male,Female,Total,Male .1,Female .1,Total.1,Male_female
State,,,,,,,
Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
Arunachal Pradesh,88695,85828,174523,39439,38352,77791,174523
Assam,1792270,1714270,3506540,944482,894428,1838910,3506540
Andaman & Nicobar Islands,17547,17768,35315,11034,11198,22232,35315
Andhra Pradesh,2165879,2032435,4198320,1309000,1229445,2538440,4198314
Assam,1792270,1714270,3506540,944482,894428,1838910,3506540

In [25]:
.filter(regex='')
.filter(like='')

SyntaxError: invalid syntax (<ipython-input-25-48f79afbb7e0>, line 1)

In [30]:
#Help in Pandas -> df.help()

## Difference Between ix and loc iloc
* loc - accessing by value
* iloc - accessing by index
* ix - first by value and then index